kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
	recvd_len = stats->sys_head.len - sizeof(stats->sys_head);
	copy_len = recvd_len < sizeof(stats->fw) ? recvd_len : sizeof(stats->fw);

	if (copy_len < sizeof(stats->fw)) {
		/* FW sent fewer stats fields than this driver knows about (e.g.
		 * older FW without interface_data_stats) - zero the rest instead
		 * of leaving stale bytes from a previous transfer in fw_stats.
		 */
		LOG_DBG("%s: Truncated stats event (recvd=%u, expected=%u)",
				      __func__, recvd_len, (unsigned int)sizeof(stats->fw));
		nrf_wifi_mem_set(fmac_dev_ctx->fw_stats, 0, sizeof(stats->fw));
	}

	nrf_wifi_mem_cpy(fmac_dev_ctx->fw_stats,
			      &stats->fw,
			      copy_len);

	fmac_dev_ctx->stats_req = false;

	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


#ifdef NRF71_UTIL
static enum nrf_wifi_status umac_event_sys_debug_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_event_debug_stats *ev = event;
	struct nrf_wifi_rpu_debug_stats *dst;

	if (!event) {
		LOG_ERR("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->debug_stats_req) {
		LOG_DBG("%s: Debug stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct nrf_wifi_rpu_debug_stats *)fmac_dev_ctx->debug_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, &ev->stats, sizeof(ev->stats));
	}
	fmac_dev_ctx->debug_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


static enum nrf_wifi_status umac_event_sys_umac_int_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct umac_int_stats *ev = event;
	struct umac_int_stats *dst;

	if (!event) {
		LOG_ERR("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->umac_int_stats_req) {
		LOG_DBG("%s: UMAC int stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct umac_int_stats *)fmac_dev_ctx->umac_int_stats;
	if (dst) {
		nrf_wifi_mem_cpy(dst, ev, sizeof(*ev));
	}
	fmac_dev_ctx->umac_int_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}
#endif /* NRF71_UTIL */

#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF
struct error_stats_log_entry {
	unsigned int status_code;
	const char *msg;
};

static const struct error_stats_log_entry umac_error_stats_log[] = {
	{ UMAC_MEM_ALLOC_FAIL, "memory allocation failed" },
};

static const struct error_stats_log_entry lmac_error_stats_log[] = {
	{ RX_INT_MEM_UNDERRUN, "RX internal memory underrun" },
	{ DATA_PATH_STUCK, "data path stuck" },
	{ WIFI_REQ_TO_PTA_FAIL, "Wi-Fi request to PTA failed" },
	{ HW_DATA_PATH_DEACTIVATE_FAIL, "HW data path deactivation failed" },
	{ HW_DATA_PATH_ACTIVATE_FAIL, "HW data path activation failed" },
	{ CAPTURE_DMA_NOT_FINISHING, "capture DMA not finishing" },
	{ FEED_DMA_NOT_FINISHING, "feed DMA not finishing" },
	{ RF_PLL_RECOVERY_FAILED, "RF PLL recovery failed" },
	{ DEVICE_IS_ACTIVE_FOR_TOO_LONG, "device active for too long" },
};

static void log_error_stats(const char *func,
			    const char *type,
			    unsigned int status_code,
			    const struct error_stats_log_entry *table,
			    size_t table_size)
{
	size_t i;

	for (i = 0; i < table_size; i++) {
		if (table[i].status_code == status_code) {
			LOG_INF("%s: %s error: %s", func, type,
					       table[i].msg);
			return;
		}
	}

	LOG_INF("%s: %s error stats: status_code=%u", func, type,
			       status_code);
}

/*
 * RF PLL status (WLDIG_READONLY0) as sampled by the LMAC error event patch at
 * the moment it raised the event. The register sits on the RPU RF bus, which
 * the application core cannot reach, so firmware mirrors it into an unused
 * LMAC stats field for us to pick up here.
 */
static void log_lmac_error_rf_pll_status(const char *func)
{
	static const struct lmac_error_stat_entry recovery_stats[] = {
		{ "lp_recovery_trigger_cnt", LMAC_DBG_LP_RECOVERY_TRIGGER_CNT_ADDR },
		{ "lp_recovery_fail_cnt", LMAC_DBG_LP_RECOVERY_FAIL_CNT_ADDR },
		{ "hp_recovery_trigger_cnt", LMAC_DBG_HP_RECOVERY_TRIGGER_CNT_ADDR },
		{ "hp_recovery_fail_cnt", LMAC_DBG_HP_RECOVERY_FAIL_CNT_ADDR },
		{ "lp_unlock_at_phy_open_cnt",
		  LMAC_DBG_LP_UNLOCK_AT_PHY_OPEN_CNT_ADDR },
		{ "hp_unlock_at_phy_open_cnt",
		  LMAC_DBG_HP_UNLOCK_AT_PHY_OPEN_CNT_ADDR },
	};
	unsigned int snapshot = sys_read32(LMAC_DBG_RF_PLL_STATUS_ADDR);
	unsigned int pll_status = snapshot & ~RF_PLL_STATUS_SNAPSHOT_VALID_MASK;
	size_t i;

	if (!(snapshot & RF_PLL_STATUS_SNAPSHOT_VALID_MASK)) {
		LOG_INF("%s: LMAC error RF PLL status: no snapshot taken", func);
	} else {
		LOG_INF("%s: LMAC error RF PLL status: 0x%08x", func, pll_status);
		LOG_INF("%s:   sxhp_adpll_locked (bit 6): %u", func,
			!!(pll_status & RF_PLL_STATUS_SXHP_ADPLL_LOCKED_MASK));
		LOG_INF("%s:   sxlp_adpll_locked (bit 15): %u", func,
			!!(pll_status & RF_PLL_STATUS_SXLP_ADPLL_LOCKED_MASK));
		LOG_INF("%s:   adpll_locked (bit 6 | bit 15): %u", func,
			!!(pll_status & (RF_PLL_STATUS_SXHP_ADPLL_LOCKED_MASK |
					 RF_PLL_STATUS_SXLP_ADPLL_LOCKED_MASK)));
	}

	LOG_INF("%s: LMAC error RF PLL recovery stats:", func);
	for (i = 0; i < ARRAY_SIZE(recovery_stats); i++) {
		LOG_INF("%s:   %s: %u", func, recovery_stats[i].name,
			sys_read32(recovery_stats[i].addr));
	}
}

/*
 * Dump the PHY/RF execution flow ring buffer, reordered oldest to newest so it
 * reads as a call sequence. A frozen exec_flow_ptr across successive events
 * means the PHY stopped executing entirely, and the last entry names where.
 */
static void log_lmac_error_phy_exec_flow(const char *func)
{
	uint8_t flow[LMAC_DBG_PHY_EXEC_FLOW_SIZE];
	uint8_t ptr = sys_read8(LMAC_DBG_PHY_EXEC_FLOW_PTR_ADDR);
	size_t i;

	for (i = 0; i < LMAC_DBG_PHY_EXEC_FLOW_SIZE; i++) {
		flow[i] = sys_read8(LMAC_DBG_PHY_EXEC_FLOW_ADDR +
				    ((ptr + i) % LMAC_DBG_PHY_EXEC_FLOW_SIZE));
	}

	LOG_INF("%s:   phy_last_sig=%u phy_exec_ptr=%u", func,
		sys_read8(LMAC_DBG_PHY_LAST_SIGNATURE_ADDR), ptr);
	LOG_HEXDUMP_INF(flow, sizeof(flow), "phy exec flow (oldest first)");
}

