kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
/*
 * Beacon reception and low-power RX state. Packed a few values per line: the
 * error events repeat every 2.5 s and the log backend already drops messages
 * at this rate.
 */
static void log_lmac_error_beacon_state(const char *func)
{
	LOG_INF("%s: LMAC error beacon state: rf_mode=%u pwr_sub_state=%u", func,
		sys_read32(LMAC_DBG_CH_INFO_RF_MODE_ADDR),
		sys_read32(LMAC_DBG_PWR_SUB_STATE_ADDR));
	LOG_INF("%s:   rx_bcn_cnt=%u bcn_rcv_last_sec=%u bcn_rcv_cur_sec=%u", func,
		sys_read32(LMAC_DBG_RX_BCN_CNT_ADDR),
		sys_read32(LMAC_DBG_BCN_RCV_CNT_LAST_SEC_ADDR),
		sys_read32(LMAC_DBG_BCN_RCV_CNT_CUR_SEC_ADDR));
	LOG_INF("%s:   wait_for_bcn_cnt=%u wait_for_bcn_expired=%u", func,
		sys_read32(LMAC_DBG_WAIT_FOR_BCN_CNT_ADDR),
		sys_read32(LMAC_DBG_WAIT_FOR_BCN_EXPIRED_ADDR));
	LOG_INF("%s:   bcn_delay_after_wakeup=%u lp2hp_bringup_time=%u", func,
		sys_read32(LMAC_DBG_BCN_DELAY_AFTER_WAKEUP_ADDR),
		sys_read32(LMAC_DBG_LP2HP_BRINGUP_TIME_ADDR));
	LOG_INF("%s:   bet_isr=%u bet_bcn_abort=%u bet_bcn_rf_switch=%u "
		"rf_mode_switch=%u", func,
		sys_read32(LMAC_DBG_LP_RX_BET_ISR_ADDR),
		sys_read32(LMAC_DBG_LP_RX_BET_BCN_ABORT_ADDR),
		sys_read32(LMAC_DBG_LP_RX_BET_BCN_RF_SWITCH_ADDR),
		sys_read32(LMAC_DBG_LP_RX_RF_MODE_SWITCH_ADDR));
	LOG_INF("%s:   deagg_isr=%u rxisr_cnt=%u rxisr_dropped_cnt=%u", func,
		sys_read32(LMAC_DBG_DEAGG_ISR_ADDR),
		sys_read32(LMAC_DBG_LMAC_RXISR_CNT_ADDR),
		sys_read32(LMAC_DBG_LMAC_RX_ISR_DROPPED_CNT_ADDR));
	LOG_INF("%s:   abort_rx_after_len=0x%04x bet_sleep_ind=%u "
		"bcn_miss_cnt=%u", func,
		sys_read32(ABS_PMB_WLAN_MAC_CTRL_DEAGG_ABORT_RX_AFTER_LEN) &
			PMB_WLAN_MAC_CTRL_DEAGG_ABORT_RX_AFTER_LEN_MASK,
		sys_read8(LMAC_DBG_BET_SLEEP_INDICATION_ADDR),
		sys_read32(LMAC_DBG_BCN_MISS_CNT_ADDR));
	LOG_INF("%s:   boot_cnt=%u warm_boot_isr=%u try_sleep=%u", func,
		sys_read32(LMAC_DBG_TOTAL_BOOT_CNT_ADDR),
		sys_read32(LMAC_DBG_WARM_BOOT_TIMER_ISR_ADDR),
		sys_read32(LMAC_DBG_TRY_TO_ENTER_SLEEP_ADDR));
	LOG_INF("%s:   pwr_main_state=%u sleep_en=%u bet_en=%u cfg_bet_en=%u",
		func,
		sys_read32(LMAC_DBG_PWR_MAIN_STATE_ADDR),
		sys_read32(LMAC_DBG_SLEEP_ENABLE_ADDR),
		sys_read32(LMAC_DBG_BET_ENABLE_ADDR),
		sys_read32(LMAC_DBG_CFG_BET_ENABLE_ADDR));
	LOG_INF("%s:   sleep_cmd_in_task=%u ps_disabled=%u buf_pool_null=%u",
		func,
		sys_read32(LMAC_DBG_SLEEP_CMD_IN_LMAC_TASK_ADDR),
		sys_read32(LMAC_DBG_WIFI_POWERSAVE_DISABLED_ADDR),
		sys_read32(LMAC_DBG_INTERNAL_BUF_POOL_NULL_ADDR));
	LOG_INF("%s:   sleep_fail: disable=%u ps_off=%u ftm=%u non_sta=%u "
		"cmds=%u", func,
		sys_read32(LMAC_DBG_SLEEP_DISABLE_CNT_ADDR),
		sys_read32(LMAC_DBG_SLEEP_FAIL_PS_OFF_ADDR),
		sys_read32(LMAC_DBG_SLEEP_FAIL_FTM_RESP_ADDR),
		sys_read32(LMAC_DBG_SLEEP_FAIL_VIF_NON_STA_ADDR),
		sys_read32(LMAC_DBG_SLEEP_FAIL_CMDS_PRESENT_ADDR));
	log_lmac_error_phy_exec_flow(func);
}

static void log_lmac_error_rx_stats(const char *func)
{
	static const struct lmac_error_stat_entry fw_stats[] = {
		{ "rx_mpdu_crc_fail_cnt", 0x28003544UL },
		{ "rx_mpdu_crc_success_cnt", 0x28003548UL },
		{ "rx_ofdm_crc_success_cnt", LMAC_DBG_RX_OFDM_CRC_SUCCESS_CNT_ADDR },
		{ "rx_ofdm_crc_fail_cnt", LMAC_DBG_RX_OFDM_CRC_FAIL_CNT_ADDR },
		{ "rx_dsss_crc_success_cnt", LMAC_DBG_RX_DSSS_CRC_SUCCESS_CNT_ADDR },
		{ "rx_dsss_crc_fail_cnt", LMAC_DBG_RX_DSSS_CRC_FAIL_CNT_ADDR },
	};
	static const struct lmac_error_stat_entry hw_stats[] = {
		{ "deagg_crc32pass_cnt", ABS_PMB_WLAN_MAC_CTRL_DEAGG_CRC32PASS_CNT },
		{ "deagg_crc32fail_cnt", ABS_PMB_WLAN_MAC_CTRL_DEAGG_CRC32FAIL_CNT },
		{ "deagg_dsss_crc32pass_cnt",
		  ABS_PMB_WLAN_MAC_CTRL_DEAGG_DSSS_CRC32PASS_CNT },
		{ "deagg_dsss_crc32fail_cnt",
		  ABS_PMB_WLAN_MAC_CTRL_DEAGG_DSSS_CRC32FAIL_CNT },
	};
	size_t i;

	LOG_INF("%s: LMAC error firmware RX CRC stats:", func);
	for (i = 0; i < ARRAY_SIZE(fw_stats); i++) {
		LOG_INF("%s:   %s: %u", func, fw_stats[i].name,
			sys_read32(fw_stats[i].addr));
	}

	LOG_INF("%s: LMAC error hardware RX CRC stats:", func);
	for (i = 0; i < ARRAY_SIZE(hw_stats); i++) {
		LOG_INF("%s:   %s: %u", func, hw_stats[i].name,
			sys_read32(hw_stats[i].addr));
	}

	log_lmac_error_rf_pll_status(func);
	log_lmac_error_beacon_state(func);
}
#endif /* WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_INF */


static enum nrf_wifi_status umac_event_sys_proc_events(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						       struct host_rpu_msg *rpu_msg)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char *sys_head = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;

	if (!fmac_dev_ctx || !rpu_msg) {
		return status;
	}


	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	sys_head = (unsigned char *)rpu_msg->msg;

	switch (((struct nrf_wifi_sys_head *)sys_head)->cmd_event) {
	case NRF_WIFI_EVENT_STATS:
		status = umac_event_sys_stats_process(fmac_dev_ctx,
						      sys_head);
		break;
	case NRF_WIFI_EVENT_INIT_DONE:
		fmac_dev_ctx->fw_init_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	case NRF_WIFI_EVENT_DEINIT_DONE:
		fmac_dev_ctx->fw_deinit_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#ifdef NRF71_RAW_DATA_TX
	case NRF_WIFI_EVENT_RAW_TX_DONE:
		status = nrf_wifi_fmac_rawtx_done_event_process(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_tx_done *)sys_head);
		break;
#endif
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_EVENT_MODE_SET_DONE:
		status = nrf_wifi_fmac_if_mode_set_event_proc(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_config_mode *)sys_head);
		break;
#endif
#if defined(NRF71_RAW_DATA_TX) || defined(NRF71_RAW_DATA_RX)
	case NRF_WIFI_EVENT_CHANNEL_SET_DONE: {
		struct nrf_wifi_event_set_channel *channel_event;
		struct nrf_wifi_sys_fmac_priv *sys_fpriv;
		struct nrf_wifi_fmac_vif_ctx *vif_ctx;
		unsigned int event_len = ((struct nrf_wifi_sys_head *)sys_head)->len;

		channel_event = (struct nrf_wifi_event_set_channel *)sys_head;
		vif_ctx = sys_dev_ctx->vif_ctx[channel_event->if_index];
		if (channel_event->status) {
			LOG_ERR("%s: set channel failed, status=%d",
					     __func__, channel_event->status);
		} else if (vif_ctx) {
			vif_ctx->channel = channel_event->chan.primary_num;
		}
		sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);
		if (sys_fpriv->callbk_fns.channel_set_done_callbk_fn) {
			sys_fpriv->callbk_fns.channel_set_done_callbk_fn(
				vif_ctx ? vif_ctx->os_vif_ctx : NULL,
				channel_event, event_len);
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
#endif /* NRF71_RAW_DATA_TX */
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
	case NRF_WIFI_EVENT_FILTER_SET_DONE:
		struct nrf_wifi_event_raw_config_filter *filter_event;

