kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	event = (struct nrf_wifi_umac_event_new_station *)event_data;

	if_index = event->umac_hdr.ids.wdev_id;

	vif_ctx = sys_dev_ctx->vif_ctx[if_index];
	if (if_index >= MAX_NUM_VIFS) {
		LOG_ERR("%s: Invalid wdev_id recd from UMAC %d",
				      __func__,
				      if_index);
		return;
	}

	if (event->umac_hdr.cmd_evnt == NRF_WIFI_UMAC_EVENT_NEW_STATION) {
		if (vif_ctx->if_type == 2) {
			nrf_wifi_mem_cpy(vif_ctx->bssid,
					      event->mac_addr,
					      NRF_WIFI_ETH_ADDR_LEN);
		}
		peer_id = nrf_wifi_fmac_peer_get_id(fmac_dev_ctx, event->mac_addr);

		if (peer_id == -1) {
			peer_id = nrf_wifi_fmac_peer_add(fmac_dev_ctx,
							 if_index,
							 event->mac_addr,
							 event->is_sta_legacy,
							 event->wme);

			if (peer_id == -1) {
				LOG_ERR("%s:Can't add new station.",
						      __func__);
				return;
			}
		}
	} else if (event->umac_hdr.cmd_evnt == NRF_WIFI_UMAC_EVENT_DEL_STATION) {
		peer_id = nrf_wifi_fmac_peer_get_id(fmac_dev_ctx, event->mac_addr);
		if (peer_id != -1) {
			nrf_wifi_fmac_peer_remove(fmac_dev_ctx,
						  if_index,
						  peer_id);
		}
	}

	return;

}
#endif /* NRF71_STA_MODE */


static enum nrf_wifi_status umac_event_ctrl_process(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						    void *event_data,
						    unsigned int event_len)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_SUCCESS;
	struct nrf_wifi_umac_hdr *umac_hdr = NULL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	struct nrf_wifi_fmac_callbk_fns *callbk_fns = NULL;
	struct nrf_wifi_umac_event_vif_state *evnt_vif_state = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	bool more_res = false;
	unsigned char if_id = 0;
	unsigned int event_num = 0;

	if (!fmac_dev_ctx || !event_data) {
		LOG_ERR("%s: Invalid parameters",
				      __func__);
		goto out;
	}

	sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	if (!sys_fpriv || !sys_dev_ctx) {
		goto out;
	}

	umac_hdr = event_data;
	if_id = umac_hdr->ids.wdev_id;
	event_num = umac_hdr->cmd_evnt;

#ifdef NRF_WIFI_CMD_EVENT_LOG
	LOG_INF("%s: Event %d received from UMAC",
			      __func__,
			      event_num);
#else
	LOG_DBG("%s: Event %d received from UMAC",
			      __func__,
			      event_num);
#endif /* NRF_WIFI_CMD_EVENT_LOG */

	if (if_id >= MAX_NUM_VIFS) {
		LOG_ERR("%s: Invalid wdev_id recd from UMAC %d",
				      __func__,
				      if_id);

		goto out;
	}

	/* CMD_STATUS is a generic command-ack, not tied to a VIF's state,
	 * so it can arrive (with wdev_id = 0 by convention) before the
	 * default VIF is registered in vif_ctx[].
	 */
	if (event_num == NRF_WIFI_UMAC_EVENT_CMD_STATUS) {
#if WIFI_NRF71_LOG_LEVEL >= NRF_WIFI_LOG_LEVEL_DBG
		struct nrf_wifi_umac_event_cmd_status *cmd_status = event_data;

		LOG_DBG("%s: Command %d -> status %d",
			__func__,
			cmd_status->cmd_id,
			cmd_status->cmd_status);
#endif
		goto out;
	}

	vif_ctx = sys_dev_ctx->vif_ctx[if_id];
	if (!vif_ctx) {
		LOG_DBG("%s: No host VIF for wdev_id %d (teardown or bring-up)",
				      __func__,
				      if_id);
		goto out;
	}
	callbk_fns = &sys_fpriv->callbk_fns;
	if (!callbk_fns) {
		LOG_ERR("%s: Invalid callbk_fns",
				      __func__);
		goto out;
	}


	switch (umac_hdr->cmd_evnt) {
	case NRF_WIFI_UMAC_EVENT_GET_REG:
		if (callbk_fns->event_get_reg) {
			callbk_fns->event_get_reg(vif_ctx->os_vif_ctx,
						  event_data,
						  event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_REG_CHANGE:
		if (callbk_fns->reg_change_callbk_fn) {
			callbk_fns->reg_change_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_TRIGGER_SCAN_START:
		if (callbk_fns->scan_start_callbk_fn) {
			callbk_fns->scan_start_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_SCAN_DONE:
		if (callbk_fns->scan_done_callbk_fn) {
			callbk_fns->scan_done_callbk_fn(vif_ctx->os_vif_ctx,
							event_data,
							event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_SCAN_ABORTED:
		if (callbk_fns->scan_abort_callbk_fn) {
			callbk_fns->scan_abort_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT:
		if (umac_hdr->seq != 0) {
			more_res = true;
		}

		if (callbk_fns->disp_scan_res_callbk_fn) {
			callbk_fns->disp_scan_res_callbk_fn(vif_ctx->os_vif_ctx,
							    event_data,
							    event_len,
							    more_res);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_IFFLAGS_STATUS:
		evnt_vif_state = (struct nrf_wifi_umac_event_vif_state *)event_data;

		if (evnt_vif_state->status < 0) {
			LOG_ERR("%s: Failed to set interface flags: %d",
					      __func__,
						evnt_vif_state->status);
			goto out;
		}
		vif_ctx->ifflags = true;
		break;
#if defined(NRF71_STA_MODE) || defined(NRF71_RAW_DATA_RX)
	case NRF_WIFI_UMAC_EVENT_SET_INTERFACE:
		if (callbk_fns->set_if_callbk_fn) {
			callbk_fns->set_if_callbk_fn(vif_ctx->os_vif_ctx,
						     event_data,
						     event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
#endif
#ifdef NRF71_STA_MODE
	case NRF_WIFI_UMAC_EVENT_TWT_SLEEP:
		if (callbk_fns->twt_sleep_callbk_fn) {
			callbk_fns->twt_sleep_callbk_fn(vif_ctx->os_vif_ctx,
							event_data,
							event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_SCAN_RESULT:
		if (umac_hdr->seq != 0) {
			more_res = true;
		}

		if (callbk_fns->scan_res_callbk_fn) {
			callbk_fns->scan_res_callbk_fn(vif_ctx->os_vif_ctx,
						       event_data,
						       event_len,
						       more_res);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_AUTHENTICATE:
		if (callbk_fns->auth_resp_callbk_fn) {
			callbk_fns->auth_resp_callbk_fn(vif_ctx->os_vif_ctx,
							event_data,
							event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_ASSOCIATE:
		if (callbk_fns->assoc_resp_callbk_fn) {
			callbk_fns->assoc_resp_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_DEAUTHENTICATE:
		if (callbk_fns->deauth_callbk_fn) {
			callbk_fns->deauth_callbk_fn(vif_ctx->os_vif_ctx,
						     event_data,
						     event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_DISASSOCIATE:
		if (callbk_fns->disassoc_callbk_fn) {
			callbk_fns->disassoc_callbk_fn(vif_ctx->os_vif_ctx,
						       event_data,
						       event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_FRAME:
		if (callbk_fns->mgmt_rx_callbk_fn) {
			callbk_fns->mgmt_rx_callbk_fn(vif_ctx->os_vif_ctx,
						      event_data,
						      event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_GET_TX_POWER:
		if (callbk_fns->tx_pwr_get_callbk_fn) {
			callbk_fns->tx_pwr_get_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_GET_CHANNEL:
		if (callbk_fns->chnl_get_callbk_fn) {
			callbk_fns->chnl_get_callbk_fn(vif_ctx->os_vif_ctx,
						       event_data,
						       event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_GET_STATION:
		if (callbk_fns->get_station_callbk_fn) {
			callbk_fns->get_station_callbk_fn(vif_ctx->os_vif_ctx,
							event_data,
							event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_NEW_INTERFACE:
		if (callbk_fns->get_interface_callbk_fn) {
			callbk_fns->get_interface_callbk_fn(vif_ctx->os_vif_ctx,
							    event_data,
							    event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_COOKIE_RESP:
		if (callbk_fns->cookie_rsp_callbk_fn) {
			callbk_fns->cookie_rsp_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS:
		if (callbk_fns->mgmt_tx_status) {
			callbk_fns->mgmt_tx_status(vif_ctx->os_vif_ctx,
						   event_data,
						   event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_UNPROT_DEAUTHENTICATE:
	case NRF_WIFI_UMAC_EVENT_UNPROT_DISASSOCIATE:
		if (callbk_fns->unprot_mlme_mgmt_rx_callbk_fn) {
			callbk_fns->unprot_mlme_mgmt_rx_callbk_fn(vif_ctx->os_vif_ctx,
								  event_data,
								  event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_CONFIG_TWT:
		if (callbk_fns->twt_config_callbk_fn) {
			callbk_fns->twt_config_callbk_fn(vif_ctx->os_vif_ctx,
							event_data,
							event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_TEARDOWN_TWT:
		if (callbk_fns->twt_teardown_callbk_fn) {
			callbk_fns->twt_teardown_callbk_fn(vif_ctx->os_vif_ctx,
							   event_data,
							   event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_NEW_WIPHY:
		if (callbk_fns->event_get_wiphy) {
			callbk_fns->event_get_wiphy(vif_ctx->os_vif_ctx,
						    event_data,
						    event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_BEACON_HINT:
	case NRF_WIFI_UMAC_EVENT_CONNECT:
	case NRF_WIFI_UMAC_EVENT_DISCONNECT:
		/* Nothing to be done */
		break;
	case NRF_WIFI_UMAC_EVENT_GET_POWER_SAVE_INFO:
		if (callbk_fns->event_get_ps_info) {
			callbk_fns->event_get_ps_info(vif_ctx->os_vif_ctx,
						      event_data,
						      event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
#ifdef NRF71_STA_MODE
	case NRF_WIFI_UMAC_EVENT_NEW_STATION:
	case NRF_WIFI_UMAC_EVENT_DEL_STATION:
		umac_event_connect(fmac_dev_ctx,
				   event_data);
		break;
#endif /* NRF71_STA_MODE */
#ifdef NRF71_P2P_MODE
	case NRF_WIFI_UMAC_EVENT_REMAIN_ON_CHANNEL:
		if (callbk_fns->roc_callbk_fn) {
			callbk_fns->roc_callbk_fn(vif_ctx->os_vif_ctx,
						  event_data,
						  event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
	case NRF_WIFI_UMAC_EVENT_CANCEL_REMAIN_ON_CHANNEL:
		if (callbk_fns->roc_cancel_callbk_fn) {
			callbk_fns->roc_cancel_callbk_fn(vif_ctx->os_vif_ctx,
							 event_data,
							 event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
#endif /* NRF71_P2P_MODE */
	case NRF_WIFI_UMAC_EVENT_GET_CONNECTION_INFO:
		if (callbk_fns->get_conn_info_callbk_fn) {
			callbk_fns->get_conn_info_callbk_fn(vif_ctx->os_vif_ctx,
							    event_data,
							    event_len);
		} else {
			LOG_ERR("%s: No callback registered for event %d",
					      __func__,
					      umac_hdr->cmd_evnt);
		}
		break;
#endif /* NRF71_STA_MODE */
	default:
		LOG_DBG("%s: No callback registered for event %d",
				      __func__,
				      umac_hdr->cmd_evnt);
		break;
	}

	LOG_DBG("%s: Event %d processed",
			      __func__,
			      event_num);

out:
	return status;
}


enum nrf_wifi_status nrf_wifi_sys_fmac_event_callback(void *mac_dev_ctx,
						      void *rpu_event_data,
						      unsigned int rpu_event_len)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct host_rpu_msg *rpu_msg = NULL;
	struct nrf_wifi_umac_hdr *umac_hdr = NULL;
	unsigned int umac_msg_len = 0;
	int umac_msg_type = NRF_WIFI_UMAC_EVENT_UNSPECIFIED;

	fmac_dev_ctx = (struct nrf_wifi_fmac_dev_ctx *)mac_dev_ctx;

	rpu_msg = (struct host_rpu_msg *)rpu_event_data;
	umac_hdr = (struct nrf_wifi_umac_hdr *)rpu_msg->msg;
	umac_msg_len = rpu_msg->hdr.len;
	umac_msg_type = umac_hdr->cmd_evnt;

#ifdef NRF_WIFI_CMD_EVENT_LOG
	LOG_INF("%s: Event type %d recd",
			      __func__,
			      rpu_msg->type);
#else
	LOG_DBG("%s: Event type %d recd",
			      __func__,
			      rpu_msg->type);
#endif /* NRF_WIFI_CMD_EVENT_LOG */

	switch (rpu_msg->type) {
	case NRF_WIFI_HOST_RPU_MSG_TYPE_DATA:
		status = nrf_wifi_fmac_data_events_process(fmac_dev_ctx,
							   rpu_msg);
		break;
	case NRF_WIFI_HOST_RPU_MSG_TYPE_UMAC:
		status = umac_event_ctrl_process(fmac_dev_ctx,
						 rpu_msg->msg,
						 rpu_msg->hdr.len);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			LOG_ERR("%s: umac_event_ctrl_process failed",
					      __func__);
			goto out;
		}
		break;
	case NRF_WIFI_HOST_RPU_MSG_TYPE_SYSTEM:
		status = umac_event_sys_proc_events(fmac_dev_ctx,
						    rpu_msg);
		break;
	default:
		goto out;
	}

out:
	return status;
}
